tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mas-cli/tap"

# Core packages
brew "pkg-config"
brew "bash"
brew "coreutils"
brew "findutils"
brew "grep"
brew "rsync"
brew "git"
brew "vim"
brew "wget"
brew "pwgen"
brew "zsh"
brew "mas"

# Development environment
brew "httpd", restart_service: true
brew "mysql@5.7", restart_service: true, link: true
brew "php@5.6"
brew "php@7.0"
brew "php@7.1", restart_service: true, link: true
brew "php@7.2", link: false
brew "dnsmasq", restart_service: true
brew "composer"

# Image related
brew "jpeg"
brew "imagemagick"
brew "jpegoptim"
brew "pngcrush"
brew "pngquant"
brew "optipng"

# Node related
brew "nave"
brew "yarn", args: ["without-node"]

cask "1password"
cask "adium"
cask "caffeine"
cask "docker"
cask "dropbox"
cask "firefox"
cask "google-chrome"
cask "google-chrome-canary"
cask "google-drive-file-stream"
cask "grandperspective"
cask "iterm2"
cask "kaleidoscope"
cask "libreoffice"
cask "owncloud"
cask "postman"
cask "sequel-pro"
cask "sketch"
cask "skype"
cask "slack"
cask "spectacle"
cask "spotify"
cask "teamviewer"
cask "typora"
cask "visual-studio-code"
cask "yemuzip"
cask "zeplin"

mas "Bear", id: 1091189122
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
